Revit 2027 API
Subelement.IsParameterModifiable Method
 Checks if given parameter of this subelement is modifiable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsParameterModifiable(
	ElementId parameterId
)
Public Function IsParameterModifiable (
	parameterId As ElementId
) As Boolean
public:
bool IsParameterModifiable(
	ElementId^ parameterId
)
member IsParameterModifiable :
        parameterId : ElementId -> bool
Parameters
parameterId ElementId
 Parameter id.
Return Value
Boolean
 True if given parameter of this subelement is modifiable, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace